[
    {
        "body": "-----\n\nI mean how many times do I have to tell them? My name is not \"Help\" or \"Getoffme.\" Get it right. Its *Brock Turner*. \n\n------\n\nSince many have mentioned it yes. Yes my Rape joke is innacurate to the actual events. But the entire point of the joke was to emphasis the fact that Brock Turner is a Rapist. So, if any of you would like to improve on the joke go ahead. I really don't care, just don't bombard the the subreddit with Brock Turner rape jokes or it will most likely get banned, and become stale. :* have fun and spread the good word. \n\nGuys. I need bail :'( http://m.imgur.com/x29gyvN\n\nThe amount of people who thought he was serious is very disheartening... This guy was joking. http://m.imgur.com/Q1iyUoT\n\n========\n\n[We did it reddit]( http://m.imgur.com/hKRnGrT)\n\n\n=======\n\n\n[No, you cannot](http://m.imgur.com/fqufGbK)\n\n",
        "id": "51c5bj",
        "score": 19025,
        "title": "I am so sick of girls calling out the wrong names during sex."
    },
    {
        "body": "The black man immediately steals three pastries and puts them in his pocket.\n\nHe says to the white, \"See how good I am? The owner didn't see a thing.\" The white man says to the black man, \"That's typical of you black people. I am going to show you an honest way to get the same result.\"\n\nHe goes to the owner of the bakery and says, \"Give me a pastry and I will show you a magic trick.\"\nIntrigued, the owner accepts and gives him a pastry. The white man swallows it and asks for another one. The owner gives him another one. Then the white man swallows that one and asks for a third pastry and eats that, too.\n\nThe owner is starting to wonder where the magic trick is and asks, \"So what did you do with the pastries?\"\n\nThe white man replies, \"Look in the black mans back pocket.....\"\n\nEDIT: I forgot that you don't get karma for jokes, :(",
        "id": "45udb4",
        "score": 19138,
        "title": "A black man and a white man walk into a bakery"
    },
    {
        "body": "Everybody misses Harambe.",
        "id": "4zqox0",
        "score": 19153,
        "title": "What's the difference between everybody and bullets?"
    },
    {
        "body": "A blonde woman walks into a bank in NYC before going on vacation and asks for a $5,000 loan.\n\nThe banker asks, \"Okay, miss, is there anything you would like to use as collateral?\"\n\nThe woman says, \"Yes, of course. I'll use my Rolls Royce.\"\n\nThe banker, stunned, asks, \"A $250,000 Rolls Royce? Really?\"\n\nThe woman is completely positive. She hands over the keys, as the bankers and loan officers laugh at her. \nThey check her credentials, make sure she is the title owner. Everything checks out.\nThey park it in their underground garage for two weeks.\n\nWhen she comes back, she pays off the $5,000 loan as well as the $15.41 interest.\n\nThe loan officer says, \"Miss, we are very appreciative of your business with us, but I have one question.\nWe looked you up and found out that you are a multi-millionaire. \nWhy would you want to borrow $5,000?\"\n\nThe woman replies, \n\"Where else in New York City can I park my car for two weeks for only $15.41 and\nexpect it to be there when I return?\"",
        "id": "30p0uc",
        "score": 19171,
        "title": "A Blonde Woman Asks For A $5000 Loan"
    },
    {
        "body": "Oops, wrong sub",
        "id": "4nuftd",
        "score": 19239,
        "title": "TIL in 1974 Russians accidentally blew up their own submarine, thinking it was an enemy"
    },
    {
        "body": "The doctor tells them theres been a mix up and doesn't know who's baby is who's. The English man runs in and grabs the only brown baby and starts to walk out. The Indian man looks relly confused and says \"I'm pretty sure that's not your baby it looks Indian so it's mine\". The English man says \"I know, but there's not a chance in hell I'm leaving here with a baby that could be Welsh.\"",
        "id": "501u0r",
        "score": 19256,
        "title": "An English man, Welsh man and a Indian man walk are in a maternity hospital."
    },
    {
        "body": "She thinks it's because she's cute with big brown eyes. But it's really because I want someone to shoot her mother with a hunting rifle.\n\n**Edit:** Some people have accused me of \"being a plagiarist\" and \"stealing other's jokes\"... Their words, not mine...\n\n*Pause for comedic value*\n\nBut seriously, this **is** a version of an Ashlee Barnhill joke. Sorry for the bamboozle fellow redditors.",
        "id": "5t72yq",
        "score": 19300,
        "title": "I call my wife Bambi"
    },
    {
        "body": "I said, \"Just because you're unwilling to try new things, doesn't mean everyone's that frigid.\"\n\n\"Not that,\" she explained, \"It's just the plumbers that come to our house have tiny dicks.\"",
        "id": "4y4qij",
        "score": 19346,
        "title": "I was watching porn with the missus and she complained, \"This is so unrealistic.\""
    },
    {
        "body": "\"I think there's water in the carburetor.\"\n\n\"How do you know?\" said the husband scornfully. \"You don't even know what the carburetor is.\"\n\n\"I'm telling you,\" repeated the wife, \"I 'm sure there's water in the carburetor.\"\n\n\"We'll see,\" mocked the husband. \"Let me check it out. Where's the car?\"\n\n\"In the swimming pool.\"",
        "id": "4wb8r4",
        "score": 19390,
        "title": "\"The car won't start,\" said a wife to her husband."
    },
    {
        "body": " After the plane was airborne, drink orders were taken.\nThe Irishman asked for a whiskey, which was promptly brought and placed before him.\n\nThe flight attendant then asked the Mormon if he would like a drink.\n\nHe replied in disgust, \"I'd rather be savagely raped by a dozen whores than let liquor touch my lips.\"\n\nThe Irishman then handed his drink back to the attendant and said, \"Me, too, I didn't know we had a choice.\"",
        "id": "51ezj2",
        "score": 19410,
        "title": "A Mormon was seated next to an Irishman on a flight from London."
    },
    {
        "body": "Dad: \"Not yet. We still haven't found anyone who wants you.\"",
        "id": "5trtfi",
        "score": 19525,
        "title": "Son: \"Dad, Am I adopted\"?"
    },
    {
        "body": "Satan is already waiting for him.\n\n'Well, I don't know what to do. See, you're on my list, but I have no free rooms for you. But you, you definitely have to stay in hell, so I'll have to find a solution. There are a few people here who aren't as bad as you are... I guess I'll let one go and you'll take their place. However, you can choose whose place you want to take.\n\n'Oh, that sounds okay I guess' says Bush.\n\nSatan leads him to the first room and opens the door. In this room, there's a huge swimming pool. In it, Reagan is drowning. He goes down, then up, then down, then up, and he's gasping for air all the while.\n\n'Oh, no,' says Bush. 'That's not for me, I'm a poor swimmer.'\n\nSatan opens the second door. The room is full of rocks and they see Nixon trying to break up the rocks with a wooden hammer.\n\n'Nah, I have problems with my shoulders and my back, that'd be such a painful thing to do day after day.'\n\nSo Satan opens the third door. In the room, they see Clinton lying on the floor, all tied up. Monica Lewinsky is lying on top of Clinton, giving him a blowjob. Bush stares at the scene with a wide smile and says:\n\n'Ah, that I could endure!'\n\n'Alright,' laughs Satan. 'Monica, you're free to go!'",
        "id": "4wpnme",
        "score": 19554,
        "title": "George Bush dies and goes to hell"
    },
    {
        "body": "Then I could afford a house in the economy they ruined.",
        "id": "32vfr6",
        "score": 19563,
        "title": "If I had a dollar for every time someone over 40 told me my generation sucks..."
    },
    {
        "body": "\"NASA: The Sky's The Limit\"",
        "id": "5tlztr",
        "score": 19674,
        "title": "Did you hear what NASA's new slogan will be once their budget is cut?"
    },
    {
        "body": "asked a son to his father.\n\n\"It means 'happy,'\" replied the father.\n\n\"Oh,\" contested the son, \"so are you gay, then?\"\n\n\"No, son, I have a wife.\"\n",
        "id": "4ttyja",
        "score": 19834,
        "title": "What does the word 'gay' mean?"
    },
    {
        "body": " \"What should I pay you?\" the monk asks. \"No price, for a holy man such as yourself,\" the barber replies. And what do you know, the next day the barber comes to open his shop, and finds on his doorstep a dozen gemstones.\n\n\nThat day, a priest comes in to have his hair cut. \"What shall I pay you, my son?\" \"No price, for a man of the cloth such as yourself.\" And what do you know, the next day the barber comes to open his shop, and finds on his doorstep a dozen roses.\n That day, Rabbi Finklestein comes in to get his payoss [sideburns] trimmed. \"What do you want I should pay you?\" \"Nothing, for a man of God such as yourself.\" And the next morning, what do you know? The barber finds on his doorstep – a dozen rabbis\n",
        "id": "4psjv7",
        "score": 19910,
        "title": "A Buddhist monk goes to a barber to have his head shaved."
    },
    {
        "body": "But not my Sister.",
        "id": "5r0r2o",
        "score": 19917,
        "title": "Most women would love to wake up on their birthday to the smell of fresh coffee, a nice breakfast, flowers and oral"
    },
    {
        "body": "...are sharing a compartment on a train as it winds its way through the Alps. Every now and then the train passes through a tunnel, during which time the compartment is plunged into complete darkness. On one such occasion, a ringing slap is heard and as the train passes back into daylight, the Frenchman is rubbing his sore, red cheek.\nThe brunette thinks 'I bet that dirty Frenchman fondled the blonde and she struck the pervert.'\nThe blonde thinks 'I bet that filthy Frenchman was looking to grope me in the dark, mistook the dowdy brunette for me and she slapped the beast.'\nThe Frenchman thinks 'I bet that perfidious Englishman touched up the blonde in the dark and she slapped me by mistake.'\nThe Englishman thinks 'I can't wait for another tunnel so I can slap that French twat again.'",
        "id": "5tdn2x",
        "score": 19993,
        "title": "An Englishman, a Frenchman, a ravishing blonde and a homely brunette..."
    },
    {
        "body": "They wanted to keep alcohol out of the high schools",
        "id": "4d6ow3",
        "score": 20093,
        "title": "Alabama changed the drinking age to 34"
    },
    {
        "body": "I'll have sex with their boyfriends",
        "id": "51zxrf",
        "score": 20119,
        "title": "One day I'll pretend to be gay. I'll make lots of female friends, gain their trust. Become their confidant, and when they least expected...BAAM!!!"
    },
    {
        "body": "\"coup coup\"",
        "id": "4t2htj",
        "score": 20324,
        "title": "What sound does a Turkey make?"
    },
    {
        "body": "The certificate paid for a visit to a medicine man living on a nearby reservation who was rumored to have a wonderful cure for erectile dysfunction.     \n\nAfter being persuaded to go, he drove to the reservation, handed his ticket to the medicine man and wondered what he was in for. \n\nThe old man handed a potion to him, and with a grip on his shoulder, warned, \"This is a powerful medicine. You take only a teaspoon and then say '1-2-3'.\" When you do, you will become more manly than you have ever been in your life and you can perform as long as you  want.\"     \n\nThe man was encouraged. As he walked away, he turned and asked, \"How do I stop the medicine from working?\"   \n\n\"Your partner must say '1-2-3-4,'\" the medicine man responded, \"but when she does, the medicine will not work again until the next full moon.\"     \n\nThe man was very eager to see if it worked so he went home, showered, shaved, took a spoonful of the medicine and then invited his wife to join him in the bedroom. When she came in, he quickly took off his clothes and said, \"1-2-3!\" Immediately, he was the manliest of men. His wife was excited and began throwing off her clothes as she asked \"What was the 1-2-3 for?\"      \n\nAnd that, boys and girls, is why we should never end our sentences with a preposition, because we could end up with a dangling participle.",
        "id": "4v1ppp",
        "score": 20345,
        "title": "On his 74th birthday, an old man received a gift certificate from his wife..."
    },
    {
        "body": "One.\n\nMen can be Feminists, too.",
        "id": "4y28jy",
        "score": 20353,
        "title": "How many Feminists does it take to screw in a lightbulb?"
    },
    {
        "body": "\"I want you to try and sell this to me.\"\n\nSo I put it under my arm, walked out of the building and went home.\n\nEventually he called my mobile and said, \"Bring it back here right now!\"\n\nI said, \"$200 and it's yours.\"",
        "id": "4wtywa",
        "score": 20370,
        "title": "I was in a job interview today when the manager handed me his laptop and said..."
    },
    {
        "body": "In court, the trucking company's lawyer was questioning Clyde. \"Didn't you say, at the moment of the accident, 'I'm fine.'\" asked the lawyer?\n\nClyde responded, \"Well, I'll tell you what happened. I had just loaded my favorite mule, Bessie, into the...\"\n\n\"I did not ask you for any details\", the lawyer interrupted. \"Just answer the question. Did you not say, at the scene of the accident, 'I'm fine?'\"\n\nClyde said, \"Well, I had  just got Bessie into the trailer and I was driving  down the road.\" \n\nThe lawyer interrupted again and said \"Judge, I'm trying to establish the fact that, at the scene of the accident, this man told the highway patrolman on the scene that he was just fine. Now several weeks after the accident he is trying to sue my client. I believe he is a fraud. Please tell him to simply answer the question.\"\n\nBy this time the judge was fairly interested in Clyde's answer and said to the lawyer \"I'd like to hear what he has to say about his favorite mule, Bessie.\"\n\nClyde thanked the judge and proceeded.\n\n\"Well as I was saying, I had just loaded Bessie, my favorite mule, into the trailer and was driving down the highway when this huge semi-truck and trailer ran the stop sign and smacked my truck right in the side.  I was thrown into one ditch and Bessie was thrown into the other. I was hurting real bad and didn't want to move. However, I could hear old Bessie moaning and groaning. I knew she was in terrible shape just by her groans.\n\nWhen the highway patrolman came on the scene he could hear Bessie moaning and groaning so he went over to her. After he looked at her and saw her near fatal condition, he took out his gun and shot her between the eyes.\n\nThen the patrolman came across the road, gun still in hand, looked at me and said, 'how are you feeling?'\n\nNow what the fuck would you say?\"\n\nEdit: wow not only is this my first post over 100 but it's front page and some kind hearted financier hath gilded this lowly pleb. Thank you all for being such an awesome community! Now move along. Back to your dickbutts and spaghetti. Nothing to see here. ",
        "id": "5qgupd",
        "score": 20602,
        "title": "A farmer named Clyde had a car accident."
    },
    {
        "body": "[removed]\n\n",
        "id": "4vb4bl",
        "score": 20695,
        "title": "How do you disappoint a Redditor?"
    },
    {
        "body": "My german girlfriend likes to rate my sexual performances on a scale of 1-10.\n\nLast night we tried anal. She kept yelling 9. That's the best I've ever done. ",
        "id": "4tav80",
        "score": 20709,
        "title": "German girlfriend"
    },
    {
        "body": "A kid walks upto his dad. He asks him to explain the difference between the words realistically and potentially. \n\nHis father responds by telling him to go ask his mother if she would sleep with their neighbour, Brett, for a million dollars. He then told him to also ask his sister whether she would sleep with their neighbour, Brett, for a million dollars. And he also told him to ask his brother whether he would sleep with Brett for a million dollars. \n\nThe kid asks everyone. He comes back and tells his dad that they all said yes. \n\nHis father responds that potentially, we're sitting on 3 million dollars. Realistically, we have two whores and a faggot in the family.",
        "id": "52e59u",
        "score": 20724,
        "title": "A kid asks his dad what the difference between 'realistically' and 'potentially' is"
    },
    {
        "body": "A family walks into a hotel and the father goes to the front desk and says \"I hope the porn is disabled.\" The guy at the desk replies. \"It's just regular porn you sick fuck.\"",
        "id": "2cgtk1",
        "score": 20878,
        "title": "A family walks into a hotel... NSFW"
    },
    {
        "body": "Because they are more likely to be dead.",
        "id": "4mdm5a",
        "score": 20976,
        "title": "A new study shows that unvaccinated children are less likely to be autistic"
    },
    {
        "body": "When the punchline becomes apparent.",
        "id": "4bzb1n",
        "score": 20992,
        "title": "When does a joke become a dad joke?"
    },
    {
        "body": "The fire consumed both books and in a tragic twist he hadn't even finished coloring the second one",
        "id": "5ser5q",
        "score": 21008,
        "title": "In breaking news, Trump's personal library has burned down"
    },
    {
        "body": "Nobody expects the Spanish in position.",
        "id": "529lph",
        "score": 21109,
        "title": "I've finally worked out why Spain is so good at football."
    },
    {
        "body": "A husband and wife are sitting quietly in bed reading when the wife looks over at him and asks the question....\n\nWIFE: \"What would you do if I died? Would you get married again?\"\n\nHUSBAND: \"Definitely not!\"\n\nWIFE: \"Why not? Don't you like being married?\"\n\nHUSBAND: \"Of course I do..\"\n\nWIFE: \"Then why wouldn't you remarry? \"\n\nHUSBAND: \"Okay, okay, I'd get married again.\"\n\nWIFE: \"You would?\" (with a hurt look)\n\nHUSBAND: (makes audible groan)\n\nWIFE: \"Would you live in our house?\"\n\nHUSBAND: \"Sure, it's a great house.\"\n\nWIFE: \"Would you sleep with her in our bed?\"\n\nHUSBAND: \"Where else would we sleep?\"\n\nWIFE: \"Would you let her drive my car?\"\n\nHUSBAND: \"Probably, it is almost new.\"\n\nWIFE: \"Would you replace my pictures with hers?\"\n\nHUSBAND: \"That would seem like the proper thing to do.\"\n\nWIFE: \"Would you give her my jewellery?\"\n\nHUSBAND: \"No, I'm sure she'd want her own.\"\n\nWIFE: \"Would you take her golfing with you?\n\nHUSBAND: \"Yes, those are always good times.\"\n\nWIFE: \"Would she use my clubs?\n\nHUSBAND: \"No, she's left-handed.\"\n\nWIFE: -- silence --\n\nHUSBAND: \"Shit.\"\n",
        "id": "5s74fh",
        "score": 21263,
        "title": "Would you remarry if I die?"
    },
    {
        "body": "So I took off her shirt.  \nThen she said, \"Take off my skirt.\"  \nI took off her skirt.  \n\"Take off my shoes.\" I took off her shoes.  \n\"Now take off my bra and panties.\"  \nand so I took them off.  \n\nThen she looked at me and said, \"I don't want to catch you wearing my things ever again.\"",
        "id": "4ifqig",
        "score": 21333,
        "title": "My sister asked me to take off her clothes"
    },
    {
        "body": "The man answers: \"Wow, how did you know?\"\n\nCashier: \"Because you're ugly.\"",
        "id": "4hj06f",
        "score": 21409,
        "title": "A man is buying a banana, an apple and two eggs. The female cashier says: \"You must be single.\""
    },
    {
        "body": "\"Peter, you've been a doctor for over 8 years now, please stop starting every phone conversation we have with that.\"",
        "id": "4yp0ex",
        "score": 21482,
        "title": "\"Mom? Don't freak out, but I'm in the hospital...\""
    },
    {
        "body": "Dear Sir/Ma'am\n\nWe are cutting your internet connection due to the following reasons:\n\n1. Illegal Downloading\n",
        "id": "48m1su",
        "score": 21498,
        "title": "What is a pirate's least favorite letter?"
    },
    {
        "body": "The first orders a beer...\nThe second orders half a beer...\nThe third orders one quarter of a beer...\nThe fourth orders one eighth of a beer...\n\nThe bartender pours two beers for the entire group, and replies \"cmon guys, know your limits.\"",
        "id": "4zybwe",
        "score": 21844,
        "title": "An infinite number of mathematicians walk into a bar..."
    },
    {
        "body": "What a ridiculous thing to fallout 4",
        "id": "3sodvg",
        "score": 21928,
        "title": "My girlfriend just dumped me for talking too much about video games"
    },
    {
        "body": "\"Don't worry about that,\" says St. Peter, \"it's only someone having the \nholes put into her shoulder blades for wings.\" \n\nThe old lady looks a \nlittle uncomfortable but carries on with the conversation.\n\nTen minutes later, there are more blood curdling screams \"Oh my God,\" \nsays the old lady, \"now what is happening?\" \n\n\"Not to worry,\" says St. Peter, \"She's just having her head drilled \nto fit the halo.\" \n\n\"I can't do this,\" says the old lady, \"I'm going to hell.\" \n\n\"You can't go there,\" says St. Peter. \"You'll be raped and sodomized.\" \n\n\"Maybe so,\" says the old lady, \"but I've already got the holes for that.",
        "id": "4p2mjn",
        "score": 22000,
        "title": "An old lady dies and goes to heaven. She's chatting it up with St.Peter at the Pearly Gates when all of a sudden she hears the most awful bloodcurdling screams."
    },
    {
        "body": "The pharmacist says the condoms come in packs of 3, 9 or 12 and asks which the young man wants.\n\n\"Well,\" he said, \"I've been seeing this girl for a while and she's really hot. I want the condoms because I think tonight's \"the\" night. We're having dinner with her parents, and then we're going out. And I've got a feeling I'm gonna get lucky after that. Once she's had me, she'll want me all the time, so you'd better give me the 12 pack.\"\n\nThe young man makes his purchase and leaves.\n\nLater that evening, he sits down to dinner with his girlfriend and her parent's. He asks if he might give the blessing, and they agree. He begins the prayer, but continues praying for several minutes.\n\nThe girl leans over and says, \"You never told me that you were such a religious person.\" \n\nHe leans over to her and whispers, \"You never told me that your father is a pharmacist.\"",
        "id": "52qbz9",
        "score": 22113,
        "title": "A young man goes into a drugstore to buy condoms"
    },
    {
        "body": "There used to be two and now it's too offensive to talk about.",
        "id": "50dxt6",
        "score": 22192,
        "title": "What do the twin towers and genders have in common?"
    },
    {
        "body": "Man, I hate babies.\n\nEDIT: Paraphrased from an old Doug Stanhope joke. [Check him out](http://www.youtube.com/watch?v=xaFZrxlPwWs), he's a great comic. One of the greatest.",
        "id": "51xayk",
        "score": 22248,
        "title": "4 million of these people enter our country every year. They are uneducated, unskilled, and contribute nothing. They are a burden to honest, hardworking Americans and our government is doing nothing to stop them, not to mention they're dirty and they smell bad. THEY DON'T EVEN SPEAK ENGLISH!!"
    },
    {
        "body": "Probably because Mexico has more aliens",
        "id": "5tk1na",
        "score": 22322,
        "title": "Trump's wall will cost 21.6 billion, Nasa's budget is only 19 billion"
    },
    {
        "body": "\"Do you mind if I join you? My partner didn't turn up\".\n\nSure, they said, you’re welcome.\n\nSo they started playing and enjoyed the game and the company of the newcomer. Part way around the course, one of the friends asked the newcomer,\n\n\"What do you do for a living?\"\n\nI’m a hit man,\" was the reply.\n\n\"You're joking!” was the response.\n\n\"No, I'm not,\" he said, reaching into his golf bag, and pulling out a beautiful Martini sniper's rifle with a large telescopic sight. \"Here are my tools.\"\n\nThat's a beautiful telescopic sight,” said the other friend, \"Can I take a look? I think I might be able to see my house from here\".\n\nSo he picked up the rifle and looked through the sight in the direction of his house.\n\n\"Yeah, I can see my house all right. \"This sight is fantastic. I can see right in the window. Wow, I can see my wife in the bedroom\".\n\n\"Ha Ha, I can see she's naked!! Wait a minute, that's my neighbor in there with her......He's naked, too!!! The bitch!\"\n\nHe turned to the hit man. “How much do you charge for a hit?\"\n\n\"I'll do a flat rate, for you: One thousand dollars every time I pull the trigger.\"\n\n\"Can you do two for me now?\"\n\n“Sure, what do you want?”\n\n\"First, shoot my wife; she's always been mouthy, so shoot her in the mouth. Then the neighbor, he's supposed to be a friend of mine, so just shoot his dick off to teach him a lesson.\"\n\nThe hit man took the rifle and took aim, standing perfectly still for a few minutes.\n\n“Are you gonna do it or not?\" asked the friend impatiently.\n\n\"Just be patient,\" said the hit man calmly . . . . . \n\"I think I can save ya a grand here.\"\n\n\nEDIT: Thank you kind stranger for the gold. It's my first and I really appreciate it!",
        "id": "4q9qjz",
        "score": 22564,
        "title": "Two old friends were just about to tee off at the first hole of their local golf course when a guy carrying a golf bag called out to them."
    },
    {
        "body": "Two guys from Michigan die and wake up in hell. The next day, the devil stops to check on them and sees them dressed in parkas, mittens and bomber hats, warming themselves around the fire.\nThe devil asks them, \"What are you doing? Isn't it hot enough for you?\"\n\nThe two guys reply, \"Well, you know, we're from Michigan, the land of ice and snow and cold. We're just happy for a chance to warm up a bit, you know.\"\n\nThe devil decides that these two aren't miserable enough and turns up the heat. The next morning, he stops by again and there they are, still dressed in their parkas, mittens and hats.\nThe devil asks them again, \"It's awfully hot down here, can't you guys feel that?\"\n\nAgain, the guys reply, \"Well, like we told you yesterday, we're from Michigan, the land of ice and snow and cold. We're just happy to warm up a little bit, you know.\"\n\nThe devil gets a little steamed up and he decides to fix the two guys. He cranks the heat up as high as it will go. The people are wailing and screaming everywhere. He stops by the room with the two guys from Michigan and finds them in light jackets and hats, grilling sausage and drinking beer. The devil is astonished. \"Everyone down here is in abject misery, and you seem to be enjoying yourselves.\"\n\nThe two Michiganders reply, \"Well, ya know, we don't get too much warm weather up there in Michigan, we've just got to have a cookout when the weather is this nice.\"\n\nThe devil is absolutely furious, he can hardly see straight. Finally, he comes up with an answer. These two love the heat because they have been cold all their lives. He decides to turn all the heat in hell off.\n\nThe next morning, the temperature is below zero, icicles are hanging everywhere, the people are shivering so bad, they are unable to wail, moan or gnash their teeth.\nThe devil smiles and heads for the room with the 2 Michiganders. He finds them back in their parkas, mittens and hats. They are jumping up and down and cheering.\nThe devil was dumbfounded. \"I don't understand. When I turn the heat up, you're happy. Now it's freezing cold, and you're happy. What is wrong with you two?\"\n\nThe Michiganders look at the devil in surprise. \"Well, don't ya know - if hell froze over, that must mean. The Lions won the Super Bowl!\"\n",
        "id": "4ub66q",
        "score": 22585,
        "title": "Two guys from Michigan die and wake up in hell."
    },
    {
        "body": "A driver was stuck in a traffic jam on the highway outside Washington, DC.\n\nNothing was moving.\n\nSuddenly, a man knocks on the window.\nThe driver rolls down the window and asks, \"What's going on?\"\n\n\"Terrorists have kidnapped the entire US Congress, and they're asking for a $100 million dollar ransom. Otherwise, they are going to douse them all in gasoline and set them on fire.\n\nWe are going from car to car, collecting donations.\"\n\n\"How much is everyone giving, on an average?\" the driver asks.\n\nThe man replies, \"Roughly a gallon.\"",
        "id": "3eft1l",
        "score": 22681,
        "title": "Congress gets kidnapped"
    },
    {
        "body": "...on a plane. Let's call them Steve and Bill.\n\n\"Dude, what if we had sex?\" asks Steve.\n\n\"You crazy? Here, on the plane? It would be awkward, everyone would watch us doing it...\"\n\n\"Man, nobody is even paying attention to anything. Look!\"\n\nSteve stands up and asks loudly:\n\n\"Could I have a pencil, please?\"\n\nNobody gives a damn. Everyone is sleeping, reading, looking out the window, etc.\n\n\"They really wouldn't care then, would they?\" says Bill.\n\nSo Steve and Bill have wild sex on the plane.\n\nLater, when the plane arrives to the airport and the people are leaving, the stewardess sees an old man who threw up all over his shirt, even his pants are soaking in the filth.\n\n\"Sir, you should've asked for a bag!\"\n\n\"I didn't dare\" whispers the old man. \"A few rows ahead I saw a man asking for a pencil and he got fucked in the ass...\"",
        "id": "3j35xh",
        "score": 22902,
        "title": "Two gay men are travelling..."
    },
    {
        "body": "\"Please Get Out The Pool\"",
        "id": "4w1wce",
        "score": 23005,
        "title": "How do you get 30 drunk Canadians out of the pool?"
    },
    {
        "body": "She said \"Yes!\". I said \"Good, because I'm breaking up with you.\"\n\nEdit: Front page! Hi mom.\n\nThanks for the gold you amazing stranger, you.",
        "id": "4hmfy8",
        "score": 23090,
        "title": "I asked my girlfriend if she'd like a day of eating ice cream and hanging with her girl friends."
    },
    {
        "body": "A bad joke timing",
        "id": "4o9g4b",
        "score": 23199,
        "title": "What's the difference between a good joke and"
    },
    {
        "body": "Britain is in the lead, but America has a Trump card.",
        "id": "4pqu2j",
        "score": 23363,
        "title": "The United States and Britain are having a competition on who can fuck themselves up the most."
    },
    {
        "body": "But when I do, he laughs\n",
        "id": "4zck28",
        "score": 23481,
        "title": "I don't always tell dad jokes"
    },
    {
        "body": "Oranges have thick skin.\n\nLet the downvotes fly, people! You've only got one!\n\nEdit: Did not expect this joke to get this good of a reception. Thanks, guys!",
        "id": "4vqjp2",
        "score": 23922,
        "title": "What's the difference between Donald and a piece of fruit?"
    },
    {
        "body": "C",
        "id": "3rw2du",
        "score": 23943,
        "title": "Open letter to the mods of /r/jokes"
    },
    {
        "body": "Father : \"That's great son. Who is she?\"\n\nSon: \"It's Tina, the neighbor's daughter\".\n\nFather : \"Ohhh I wish you hadn't said that.I have to tell u something son, but you\nmust promise not to tell your mother.Tina is actually your sister.\"\n\nThe boy is naturally bummed out, but a couple of months later\n\nSon : \"Daddy, I fell in love again and she is even hotter!\"\n\nFather : \"That's great son. Who is she?\"\n\nSon: \"It's Peny, the other neighbor's daughter.\"\n\nFather : \"Ohhhh I wish you hadn't said that. Peny is also your sister.\"\n\nThis went on couple of times and the son was so mad,he went straight to his mother\ncrying.\n\nSon : \"Mum I am so mad at dad ! I fell in love with six girls but I can't date any of them because daddy is their father!\"\n\nThe mother hugs him affectionately and says:\n\n\"My love, you can date whoever you want. Don't listen to him. He is not your\nFather.\"!!!\n",
        "id": "5tghsf",
        "score": 23968,
        "title": "Son : \"Daddy, I fell in love & want to date this awesome girl!\""
    },
    {
        "body": "\"Jump in, I'll give you a lift home\" I said.\n\"Fuck off\" he shouted back.\n\"What an ungrateful little cunt\" I thought as I zipped up my backpack and continued my walk.",
        "id": "4fbjvk",
        "score": 24065,
        "title": "I saw my dwarf neighbor at a bus stop"
    },
    {
        "body": "Out of respect, we should at least wait until it takes place.",
        "id": "5smhxt",
        "score": 24226,
        "title": "These Bowling Green Massacre jokes are too soon"
    },
    {
        "body": "An anti-semite is drinking in a bar. He notices a Jew sitting at a table nearby and doesn't like it.\n\"Bartender!\" he says, nodding at the Jew, \"A round of the good stuff for everyone except him!\"\nEveryone happily receives a glass of premium scotch.\nThe [anti-semite!](http://www.afterfeed.com/story/detail/13350/14-epic-jokes-by-chandler-bing-from-friends-that-will-make-hole-in-your-belly) looks over at the Jew with a smug grin.\nThe Jew smiles back.\nThe anti-semite loses his satisfied expression.\n\"Bartender! Give everyone a drink of your finest, plus an appetizer!\"\nHe looks directly at the Jew and adds, \"Everyone except the Jew.\"\nThe Jewish man looks at the anti-semite, and smiles again.\nFurious, the anti-semite says, \"Is that Jew just stupid or pretending to be?\"\n\"Oh no, sir, he's the owner.\"",
        "id": "4wk06e",
        "score": 24521,
        "title": "An anti-semite goes to a bar"
    },
    {
        "body": "Apparently the correct term is 'conjoined twins'",
        "id": "5q6xuu",
        "score": 24610,
        "title": "I pissed off two men today because I referred to them as hipsters.."
    },
    {
        "body": "They got tired of people pretending to be Ash. \n\n\n\n\n\n\n\n\nEdit: Wow thank you for the gold mates! Hopefully none of you Jews will try to steal it from me... kidding.\n\nFor those of you who were offended... please try to take it easy. It's a joke. You should find humor in everything. Life's more fun that way. ",
        "id": "4st4cc",
        "score": 24686,
        "title": "Did you hear that Auschwitz had to ask visitors to stop playing Pokemon Go?"
    },
    {
        "body": "...are sharing a compartment on a train as it winds its way through the Alps. Every now and then the train passes through a tunnel, during which time the compartment is plunged into complete darkness. On one such occasion, a ringing slap is heard and as the train passes back into daylight, the Frenchman is rubbing his sore, red cheek.\n\nThe brunette thinks 'I bet that dirty Frenchman fondled the blonde and she struck the pervert.'\n\nThe blonde thinks 'I bet that filthy Frenchman was looking to grope me in the dark, mistook the dowdy brunette for me and she slapped the beast.'\n\nThe Frenchman thinks 'I bet that perfidious Englishman touched up the blonde in the dark and she slapped me by mistake.'\n\nThe Englishman thinks 'I can't wait for another tunnel so I can slap that French twat again.'\n",
        "id": "4jt3s9",
        "score": 24745,
        "title": "An Englishman, a Frenchman, a ravishing blonde and a homely brunette..."
    },
    {
        "body": "\"This is not working I'm going to my mum's house.\"\n\nSo, I opened the fridge's door, the light came on and the juice was cold. \n\n- What the hell did she mean?",
        "id": "5qn4zn",
        "score": 24815,
        "title": "My girlfriend left a note on the fridge"
    },
    {
        "body": "[removed]",
        "id": "2pzjyg",
        "score": 24985,
        "title": "A Joke About Kim Jong Un"
    },
    {
        "body": "She decides to report it to the pilot immediately.  \n\n\"Sir, I think we have a case of human trafficking!  The female passenger looks pretty frightened and the man she is with looks dangerous!\"\n\nThe pilot responds, \"Patricia, I've told you before. This is Air Force One...\"",
        "id": "5sjkgb",
        "score": 25160,
        "title": "A flight attendant sees a suspicious couple on board..."
    },
    {
        "body": "Kinda like yo momma.",
        "id": "5rx2qm",
        "score": 25454,
        "title": "Every \"yo momma\" joke has been done thousands of times, by thousands of different people."
    },
    {
        "body": "Two married buddies are out drinking one night when one turns to the other and says, \"You know, I don't know what else to do. Whenever I go home after we've been out drinking, I turn the headlights off before I get to the driveway. I shut off the engine and coast into the garage. I take my shoes off before I go into the house, I sneak up the stairs, I get undressed in the bathroom. I ease into bed and my wife STILL wakes up and yells at me for staying out so late!\"\n\nHis buddy looks at him and says, \"Well, you're obviously taking the wrong approach. I screech into the driveway, slam the door, storm up the steps, throw my shoes into the closet, jump into bed, rub my hands on my wife's ass and say, 'How about a blowjob?' ....And she's always sound asleep.\"",
        "id": "4mo4wl",
        "score": 25587,
        "title": "How bout a blowjob?"
    },
    {
        "body": "Whoops wrong sub",
        "id": "3ll81d",
        "score": 25824,
        "title": "TIL you can get dishonorably discharged from the Navy for boarding the wrong vessel just once"
    },
    {
        "body": "A soldier ran up to a nun. Out of breath he asked, \"Please, may I hide under your skirt. I'll explain later.\"\nThe nun agreed...\nA moment later two Military Police ran up and asked, \"Sister, have you seen a soldier?\"\nThe nun replied, \"He went that way.\"\nAfter the MPs ran off, the soldier crawled out from under her skirt and said, \"I can't thank you enough, sister. You see, I don't want to go to Syria.\"\nThe nun said, \"I understand completely.\"\nThe soldier added, \"I hope I'm not rude, but you have a great pair of legs!\"\nThe nun replied, \"If you had looked a little higher, you would have seen a great pair of balls…. I don't want to go to Syria either.\"",
        "id": "5r86mm",
        "score": 25828,
        "title": "A soldier ran up to a nun"
    },
    {
        "body": "A Nazi goes to a bar, looks around, and sees an Orthodox Jew sitting at a nearby table.\n\n\"Barkeep!\", he says, \"A round on me for everyone but that gentleman right there.\" \n\nEveryone in the bar receives a cocktail, he looks over at the Jew and notices him smiling back. The Nazi is not amused, goes back to the bar\n\n\"Barkeep! I want to order a second round for everyone but him, and this time make it all top shelf\".\n\nNazi looks again at the Jew, sees him STILL smiling back.\n\n\"Is that Jew an idiot or what?\"\n\nBartender responds: \"Oh no my friend, that's the owner.\"",
        "id": "5t4u3j",
        "score": 26011,
        "title": "A Nazi goes to a bar..."
    },
    {
        "body": "Completely ruined our 10-year anniversary.",
        "id": "4ukfxr",
        "score": 26241,
        "title": "My girlfriend's father called me a pedophile just because she's 22 and I'm 36."
    },
    {
        "body": "To beat the crowd.",
        "id": "51plu4",
        "score": 26514,
        "title": "Why do riot police like to get to work early?"
    },
    {
        "body": "So we can think about a solution in silence.",
        "id": "4gzfj0",
        "score": 26603,
        "title": "Why are women and children evacuated first in a disaster?"
    },
    {
        "body": "Scientists recently did a study on the effects the right side and left side of a brain had on counting.\nThey first took out the left half of a man's brain and asked him to count to 10.\n\n He says, \"2, 4, 6, 8, 10\".\n\nThey put the left half back in and removed the right half, asking him to count to 10 again. \n\nHe says \"1, 3, 5, 7, 9\".\n\nFinally they decided to just go for it and removed the whole brain. They again asked him to count to 10 one more time.\n\nHe says, \"Look. I'm great at counting to 10, ok? I love numbers and I have the best numbers. No one has better numbers than I do. My 4th grade math teacher - and let me tell you, she was the best and smartest math teacher in the country at the time - my 4th grade math teacher said to me that I am the best counter she's ever seen. The best. So if you want me to count to 10, let me tell you I can count to 10 alright. That's no problem. I will do it. I will. And I will do it better than any has ever done it before, ok?\"",
        "id": "4elnpl",
        "score": 26721,
        "title": "A new twist on an old joke."
    },
    {
        "body": " Very worried, the mother goes to the drugstore and buys a pregnancy kit. The test result shows that the girl is pregnant. Shouting, cursing, crying, the mother says, \"Who was the pig that did this to you? I want to know!\" The girl picks up the phone and makes a call.\nHalf an hour later, a Ferrari stops in front of their house. A mature and distinguished man with gray hair and impeccably dressed in an Armani suit steps out of the of the Ferrari and enters the house.\nHe sits in the living room with the father, mother, and the girl and tells them: \"Good morning, your daughter has informed me of the problem. I can't marry her because of my personal family situation but I'll take charge. I will pay all costs and provide for your daughter for the rest of her life.\" \"Additionally, if a girl is born, I will bequeath a Ferrari, a beach house, two retail stores, a townhouse, a beachfront villa, and a $2,000,000 bank account. If a boy is born, my legacy will be a couple of factories and a $4,000,000 bank account. If twins, they will receive a factory and $2,000,000 each. However, if there is a miscarriage, what do you suggest I do?\"\n\nAt this point, the father, who had remained silent, places a hand firmly on the man's shoulder and tells him, \"You fuck her again.\"",
        "id": "52hnx1",
        "score": 26851,
        "title": "An 18 year old Italian girl tells her Mom that she has missed her period for two months......."
    },
    {
        "body": "You should've seen her face when I tossed her some diet pills. \n",
        "id": "5s50we",
        "score": 27434,
        "title": "My wife told me to go and get some pills that help with an erection..."
    },
    {
        "body": "A young student nurse appears and gives him a partial sponge bath.\n\n\"Nurse,\"' he mumbles from behind the mask, \"are my testicles black?\"\n\nEmbarrassed, the young nurse replies, \"I don't know, Sir. I'm only\nhere to wash your upper body and feet.\"\n\nHe struggles to ask again, \"Nurse, please check for me. Are my\ntesticles black?\"\n\nConcerned that he might elevate his blood pressure and heart rate from worrying about his testicles, she overcomes her embarrassment and pulls back the covers.\n\nShe raises his gown, holds his manhood in one hand and his testicles gently in the other.\n\nShe looks very closely and says, \"There's nothing wrong with them,\nSir. They look fine.\"\n\nThe man slowly pulls off his oxygen mask, smiles at her, and says very slowly, \"Thank you very much. That was wonderful.\nNow listen very, very closely: \n\nAre - my - test - results - back?\"",
        "id": "5qur1w",
        "score": 27736,
        "title": "A male patient is lying in bed in the hospital, wearing an oxygen mask over his mouth and nose."
    },
    {
        "body": "I've never quite figured out why the sexual urges of men and women differ so much.\n\nAnd I never have figured out the whole Venus and Mars thing or why men think with their head and women with their heart.\n\nFor example… One evening last week, my wife and I were getting into bed.\n\nWell, the passion started to heat up, but then she said \"I don't feel like it, I just want you to hold me.\"\n\nI said \"WHAT??!! What was that?!\"\n\nSo she said the words that every husband on the planet dreads to hear...\"You're just not in touch with my emotional needs as a woman enough for me to satisfy your physical needs as a man.\"\n\nShe responded to my puzzled look by saying, \"Can't you just love me for who I am and not what I do for you in the bedroom?\"\n\nRealizing that nothing was going to happen that night, I went to sleep.\n\nThe very next day, I opted to take the day off of work to spend time with her. We went out to a nice lunch and then went shopping at a big, high-end department store. I walked around with her while she tried on several very expensive outfits. She couldn't decide which one to take so I told her we'd just buy them all. She wanted new shoes to compliment her new clothes, so I said lets get a pair for each outfit. We went on to the jewellery department where she picked out a pair of diamond earrings.\n\nLet me tell you...she was so excited. She must have thought I was one wave short of a tsunami. I started to think she was testing me because she asked for a tennis bracelet when she doesn't even know how to play tennis. But, I think I threw her for a loop when I said, \"That's fine, honey.\"\n\nShe appeared to be almost nearing sexual satisfaction from all of the excitement. Smiling with excited anticipation she finally said, \"I think this is all dear; let's go to the cashier.\"\n\nI could hardly contain myself when I blurted out, \"No honey, I don't feel like it.\"\n\nHer face just went completely blank as her jaw dropped with a baffled, \"WHAT?\"\n\nI then said \"Honey, I just want you to HOLD this stuff for a while.\n\nYou're just not in touch with my financial means as a man, enough for me to satisfy your shopping needs as a woman.\"\n\nAnd just when she had this look like she was going to kill me, I added, \"Why can't you just love me for who I am and not for the things I buy you?\"\n\nApparently, no sex tonight either!\n\n\n\nEdit: Didn't expect to make front page but glad lots of you got a laugh out of it!\n\nEdit 2: Thank you for the gold! ",
        "id": "5sznk7",
        "score": 27763,
        "title": "No Sex Tonight!"
    },
    {
        "body": "America.",
        "id": "48sxql",
        "score": 27873,
        "title": "If Hillary Clinton and Donald Trump are in a boat and it capsizes. Who survives?"
    },
    {
        "body": "I know he means well...",
        "id": "4zlc1h",
        "score": 28782,
        "title": "My friend keeps saying \"cheer up man it could be worse, you could be stuck underground in a hole full of water\""
    },
    {
        "body": "they're white, they're cold, and if you put enough of em together they'll shut down public schools\n\nEDIT* Thanks for the gold! You popped my gold cherry! \n\nits a joke folks. just a joke.",
        "id": "5sxr4y",
        "score": 28995,
        "title": "Republicans are the true snowflakes..."
    },
    {
        "body": "\"...and I would have gotten away with it if it weren't for you medaling kids!\"",
        "id": "4yiv2v",
        "score": 29049,
        "title": "What did Lochte say after his teammates told the police what really happened?"
    },
    {
        "body": "[removed]",
        "id": "4nr6gd",
        "score": 29290,
        "title": "So I went on r/news today.."
    },
    {
        "body": "Social security",
        "id": "5sqnqg",
        "score": 29617,
        "title": "'90s kids won't get this"
    },
    {
        "body": "The leader says, \"We are all here today to prove to the world that blondes are not stupid. Can I have a volunteer?\"  \n  \nA blonde gingerly works her way through the crowd and steps up to the stage.  \n  \nThe leader asks her, \"What is 15 plus 15?\"  \n  \nAfter 15 or 20 seconds she says, \"Eighteen!\"  \n  \nObviously everyone is a little disappointed. Then 80,000 blondes start cheering, \"Give her another chance! Give her another chance!\"  \n  \nThe leader says, \"Well since we've gone to the trouble of getting 80,000 of you in one place and we have the world- wide press and global broadcast media here, gee, uh, I guess we can give her another chance.\"  \n  \nSo he asks, \"What is 5 plus 5?\"  \n  \nAfter nearly 30 seconds she eventually says, \"Ninety?\"  \n  \nThe leader is quite perplexed, looks down and just lets out a dejected sigh -- everyone is disheartened - the blonde starts crying and the 80,000 girls begin to yell and wave their hands shouting, \"GIVE HER ANOTHER CHANCE! GIVE HER ANOTHER CHANCE!\"  \n  \nThe leader, unsure whether or not he is doing more harm than good, eventually says, \"Ok! Ok! Just one more chance -- What is 2 plus 2?\"  \n  \nThe girl closes her eyes, and after a whole minute eventually says, \"Four?\"  \n  \nThroughout the stadium pandemonium breaks out as all 80,000 girls jump to their feet, wave their arms, stomp their feet and scream... \"Give her another chance! Give her another chance!\"  ",
        "id": "5062bs",
        "score": 29802,
        "title": "80,000 blondes meet in a football stadium for a \"Blondes Are Not Stupid\" Convention."
    },
    {
        "body": "There was a man in Bulgaria who drove a train for a living.\n\nHe loved his job, driving a train had been his dream ever since he was a child. \n\nHe loved to make the train go as fast as possible. \n\nUnfortunately, one day he was a little too reckless and caused a crash. \n\nHe made it out, but a single person died. \n\nWell, needless to say, he went to court over this incident. \n\nHe was found guilty, and was sentenced to death by electrocution. \n\nWhen the day of the execution came, he requested a single banana as his last meal. \n\nAfter eating the banana, he was strapped into the electric chair. \n\nThe switch was flown, sparks flew and smoke filled the air- but nothing happened.\n\nThe man was perfectly fine.\n\nWell, at the time, there was an old Bulgarian law that said a failed execution was a sign of divine intervention, so the man was allowed to go free. \n\nAnd somehow, he managed to get his old job back driving the train. \n\nHaving not learned his lesson at all, he went right back to driving the train with reckless abandon. \n\nOnce again, he caused a train to crash, this time killing two people. \n\nThe trial went much the same as the first, resulting in a sentence of execution. \n\nFor his final meal, the man requested two bananas. \n\nAfter eating the bananas, he was strapped into the electric chair.\n\nThe switch was thrown, sparks flew, smoke filled the room- and the man was once again unharmed.\n\nWell, this of course meant that he was free to go. \n\nAnd once again, he somehow manages to get his old job back. \n\nTo what should have been the surprise of no one, he crashed yet another train and killed three people. \n\nAnd so he once again found himself being sentenced to death. \n\nOn the day of his execution, he requested his final meal- three bananas.\n\n\"You know what? No,\" said the executioner. \"I've had it with you and your stupid bananas and walking out of here unharmed. I'm not giving you a thing to eat, we're strapping you in and doing this now.\" \n\nWell, it was against protocol, but the man was strapped in to the electric chair without a last meal. \n\nThe switch was pulled, sparks flew, smoke filled the room- and the man was still unharmed. \n\nThe executioner was speechless.\n\nThe man looked at the executioner and said \"Oh, the bananas had nothing to do with it. I'm just a bad conductor.\"",
        "id": "4khrw8",
        "score": 30019,
        "title": "There was a man in Bulgaria who drove a train for a living..."
    },
    {
        "body": "With iPhone accessories.  ",
        "id": "51t7fe",
        "score": 30499,
        "title": "How do you milk sheep?"
    },
    {
        "body": "Whoops, wrong sub.",
        "id": "2qmkf0",
        "score": 30863,
        "title": "TIFU by mixing up by wifes sandwich order at Subway"
    },
    {
        "body": "because you can't truly be Hitler until you blame a jew for all your problems.",
        "id": "4a9ax9",
        "score": 30882,
        "title": "Trump is blaming Sanders for the violence at his rally..."
    },
    {
        "body": "So I made her marry an old guy she's never met to secure an alliance with the French.\n",
        "id": "5qeezz",
        "score": 31006,
        "title": "My girlfriend kept telling me to treat her like a princess."
    },
    {
        "body": "A Jewish man sends his son to Israel to live there for a while. Eventually he returns home and he is now a Christian.  The man finds this to be odd and mentions it to his friend.\n\nThe friend listens, thinks for a moment and says, \"That's odd.  I sent my son to Israel as a Jew and he returned as a Christian.\"  So the two of them went to see the Rabbi.  \n\nThey told the Rabbi the story of how they had both sent their sons to Israel as Jews, and how both sons had returned as Christians.  The Rabbi listened, thought for a minute and then said \"That's odd.  I also sent my son to Israel as a Jew and he returned as a Christian.\"\n\nSo the three of them decide to go to Israel to find out what's going on over there.  The arrive and go straight to the Western Wall to pray.  They explain to God all about how they sent their sons to Israel as Jews and how the all returned as Christians.\"\n\nThere is a long silence, and then God begins to speak saying, \"That's odd . . . \"",
        "id": "4pnbc6",
        "score": 32017,
        "title": "A Jewish man sends his son to Israel to live there for a while . . ."
    },
    {
        "body": "Dear sir,\n\nYour internet access has been terminated due to illegal usage.\n\nSincerely, your service provider.",
        "id": "4vvaie",
        "score": 32974,
        "title": "What's a pirate's least favorite letter?"
    },
    {
        "body": "'Forget everything you learned in college. You won't need it working here.'\n\n'But I never went to college.'\n\n'Well then, I'm sorry. You are underqualified to work here.'",
        "id": "4zu8ii",
        "score": 33626,
        "title": "Forget everything you learned in college..."
    },
    {
        "body": "He winked at me and said, \"I'm off duty in ten minutes - meet me in the car park.\"",
        "id": "5rmhv3",
        "score": 35412,
        "title": "Just after my wife had given birth, I asked the doctor, \"How soon do you think we'll be able to have sex?\""
    },
    {
        "body": "Please don't upvote. Her strap-on is huge. ",
        "id": "4pj3q3",
        "score": 35772,
        "title": "For every upvote this gets, my girlfriend and I will try one thrust of anal sex."
    },
    {
        "body": "We went and had some drinks. Cool guy. Wants to be a web developer.",
        "id": "4wgall",
        "score": 36421,
        "title": "My girlfriend told me to take the spider out instead of killing it."
    },
    {
        "body": "But its a silly comparison really, its like comparing apples to oranges. ",
        "id": "5s9jog",
        "score": 39570,
        "title": "Steve jobs would have been a better president than Donald Trump."
    },
    {
        "body": "/r/Jokes",
        "id": "4xjyho",
        "score": 45500,
        "title": "I found a place where the recycling rate is 98%"
    },
    {
        "body": "On the condition he gets to install windows.\n\n\n",
        "id": "5tn84z",
        "score": 48526,
        "title": "Breaking News: Bill Gates has agreed to pay for Trump's wall"
    }
]
